#Пользователь вводит число. Вывести True если чётное, иначе - False.

number= int(input('Введите число для проверки: '))
print(('Данное число является чётным -'), number % 2 == 0)

#Можно и без текста , но для меня это выглядит куда красивее
