# Вывести на экран числа кратные 5 от 0 до 100 включительно.
# Сделать это с помощью функции range с шагом 5

for num in range(0, 101, 5):
    print(num)